//Line chart
new Chart(document.getElementById("sig-time-line-chart"), {
  type: 'line',
  data: {
    labels:['0s',"1s","2s","3s","4s","5s","6s","7s","8s","9s","10s"],
    // labels: ['0s',"1s","2s","3s","4s","5s","6s","7s","8s","9s","10s","11s","12s","13s","14s","15s","16s","17s","18s","19s",
    //   "20s","21s","22s","23s","24s","25s","26s","27s","28s","29s","30s"],
    datasets: [{ 
        data: [0,2895052.8,4793958.4,4692845,4790834,4811468.8,4795847,4734570,4693847,4703488,4660976.64],
        label: "IPsec签名认证方法比特率",
        borderColor: "#3e95cd",
        fill: false
      }, { 
        data: [0,47793881.6,58266240,65564568,98275843,117451566.08,121945864,122905834,123958475,124789575.68,124372882.73],
        label: "哈希链签名认证方法比特率",
        borderColor: "#8e5ea2",
        fill: false
      }, { 
        data: [0,45242585.6,55093171.2,61385028,82595573,104157081.6,110938473,114384950,118384728,121270333.44,122511712.43],
        label: "共享密钥哈希链签名认证方法比特率",
        borderColor: "#3cba9f",
        fill: false
      }, { 
        data: [0,42405184,57031705.6,62385761,79285928,97863884.8,109938475,115948596,119384956,120565094.4,119852038.83],
        label: "哈希加盐哈希链签名认证方法比特率",
        borderColor: "#e8c3b9",
        fill: false
      }
    ]
  },
  options: {
    title: {
      display: true,
      text: '签名认证方法比特率-时间 图'
    }
  }
});


//Line chart
new Chart(document.getElementById("sig-interval-line-chart"), {
  type: 'line',
  data: {
    labels:['0s',"1s","2s","3s","4s","5s","6s","7s","8s","9s","10s"],
    // labels: ['0s',"1s","2s","3s","4s","5s","6s","7s","8s","9s","10s","11s","12s","13s","14s","15s","16s","17s","18s","19s",
    //   "20s","21s","22s","23s","24s","25s","26s","27s","28s","29s","30s"],
    datasets: [{
        data: [0,2895052.8,4793958.4,4692845,4790834,4811468.8,4795847,4734570,4693847,4703488,4660976.64],
        label: "IPsec签名认证方法",
        borderColor: "#3e95cd",
        fill: false
      }, {
        data: [0,47793881.6,58266240,65564568,98275843,117451566.08,121945864,122905834,123958475,124789575.68,124372882.73],
        label: "无签名报文哈希链认证方法",
        borderColor: "#8e5ea2",
        fill: false
      }, {
        data: [0,20742351.36,26900514.64,34385028,37595573,38699726.56,37938473,38384950,38384728,38563865.94,38276962.66],
        label: "签名间隔为10的报文哈希链签名认证方法",
        borderColor: "#3cba9f",
        fill: false
      }, {
        data: [0,39434870.54,48755452.22,59385761,79285928,97041741.55,100938475,102948596,102384956,102218199.82,102766648.34],
        label: "签名间隔为100的报文哈希链签名认证方法",
        borderColor: "#e8c3b9",
        fill: false,
      }, {
        data: [0,45078475.03,54891307.63,62385761,89285928,113042738.35,117938475,118948596,119384956,121096874.51,121673143.68],
        label: "签名间隔为1000的报文哈希链签名认证方法",
        borderColor: "#6ff4f7",
        fill: false
      }
    ]
  },
  options: {
    title: {
      display: true,
      text: '不同签名间隔比特率-时间 图'
    }
  }
});

